# -*- coding:utf-8 -*-
import random

class VAS_GUI():
    # 获取随机名单
    def get_files(self, strings, group_size):
        random.shuffle(strings)
        grouped_strings = [strings[i:i+group_size] for i in range(0, len(strings), group_size)]
        return grouped_strings


def gui_start():
    VAS = VAS_GUI()
    input_strings = ["赖总", "姜姐", "石元峰", "巩丹丹", "管晓吉", "李娟", "单晓", "杨雪", "孟琳", "任晓晨", "林彤彤", "张巍旭", "刘凤俏", "田芳", "张昕", "张天媛", "丛宇婷", "李瑞莲", "王贺", "孙洪义", "曲晓璞", "张悦", "冮宁", "张晓君", "杨娣", "田佳桐", "刘倩", "宁宇杰", "季毅", "张素梅", "宋云生", "李安平", "彭俊尧", "李敏", "王楠", "吴晓丹", "刘金彤", "崔小丽", "罗超", "刘彬", "王黎明", "吕明慧", "何畔", "纪红梅", "刘姣", "赫爱琴", "薛敏", "李林", "林鹏", "宋清云", "杨雪", "李欣阳", "郭晓雨", "张佳雯", "杨丹", "赵少萱", "汪明珠", "刘宏", "葛微微", "林晓光", "韩继波", "蓝黎旻", "杜雨燕 ", "于晓慧", "仪德宇", "金志海", "赵程程", "刘娥", "高妮", "宋心宇", "姜萌萌", "邓晓娜", "高林艳", "杨秀坤", "刘宇婷", "钟吉莅", "宫殿嫔", "初文杰", "王有喜", "陈明昊", "宋进举", "刘新", "  公兵  ", "吴立强", "矫世军", "史运刚", "赖文光", "沈静", "朱叶", "张汀汀", "赵青", "周晶晶", "孙华", "邹越", "方圆", "张桂芹", "杨立君", "李佳音", "杜双", "李士闯", "马俊威", "刘亚辉", "肖阿婷", "李楠", "戴世强", "孙健", "孙中华", "王威", "梅新鑫", "梁伟光", "刘阳", "车帅", "王晓庆", "黄雪", "宋婷婷", "赵桐", "郭宏", "于英杰", "汪雨潼", "谷美红", "刘可心", "宋宝龙", "高宪鹏", "潘恩磊", "范庆春", "杨以梅", "宋岩", "尹士霞", "刘艳", "解华丽", "陈莹", "陈凤洁", "姚钧译", "张云彤", "周福禄", "刘顺发", "张延平", "颜士松", "于秀红", "王馨悦", "李硕", "孙蕾淼", "刘欣妍", "吴珊珊", "李海丹", "巴春凤", "姜燕", "吕俊", "张美双", "李晶", "于桂彦", "邵立影", "于苓", "张宇", "葛明晶", "张千里", "高明", "田宝建", "赵文刚", "姜玉喜", "赵春艳", "张当清", "肖娜", "汪玉"]

    group_size = 10
    result = VAS.get_files(input_strings, group_size)

    # 处理剩余的不足10个字符串
    if len(result[-1]) < group_size:
        remaining_strings = result.pop()
        while remaining_strings:
            group = remaining_strings[:group_size]
            result.append(group)
            remaining_strings = remaining_strings[group_size:]

    for group in result:
        print(group)


if __name__ == '__main__':
    gui_start()
